abstract class DropdownButtonList {
  static List<String> martialStatusMaleList = [
    'أعزب',
    'متزوج',
    'مطلق',
    'أرمل',
  ];
  static List<String> martialStatusFemaleList = [
    'عزباء',
    'متزوجة',
    'مطلقة',
    'أرملة',
  ];

  static List<String> nationalityMaleList = [
    'عراقى',
    'سورى',
    'لبنانى',
    'أردنى',
    'فلسطينى',
    'كويتى',
    'بحرينى',
    'قطرى',
    'اماراتى',
    'عمانى',
    'يمنى',
    'سعودى',
    'مصرى',
    'سودانى',
    'ليبى',
    'تونسى',
    'جزائرى',
    'مغربى',
  ];
  static List<String> nationalityFemaleList = [
    'عراقية',
    'سورية',
    'لبنانية',
    'أردنية',
    'فلسطينية',
    'كويتية',
    'بحرينية',
    'قطرية',
    'اماراتية',
    'عمانية',
    'يمنية',
    'سعودية',
    'مصرية',
    'سودانية',
    'ليبية',
    'تونسية',
    'جزائرية',
    'مغربية',
  ];

  static List<String> currentResidenceCountryList = [
    'مصر',
    'سوريا',
    'لبنان',
    'تونس',
  ];

  static List<String> currentResidenceCityList = [
    'قنا',
    'بنها',
    'اسوان',
    'القاهرة',
    'البحيرة',
    'الاسكندرية',
    'اسيوط',
  ];

  static List<String> educationalDegreeList = [
    'الشهادة الابتدائية',
    'الشهادة الاعدادية',
    'الشهادة الثانوية',
    'دبلوم',
    'الشهادة الجامعية',
    'دراسات عليا - ماجستير',
    'دراسات عليا - الدكتوراة',
  ];
  static List<String> skinColorList = [
    'بيضاء جدا',
    'بيضاء',
    'متوسطة',
    'قمحية',
    'داكنة',
  ];
  static List<String> prayerCommitmentList = [
    'أصلى جميع الصلوات فى وقتها فى المسجد',
    'أصلى جميع الصلوات فى وقتها فى البيت',
    'أصلى جميع الصلوات ولكن قد أفوت بعض الصلوات عن وقتها',
    'متقطع فى الصلاة',
    'لا أصلى معظم الوقت',
  ];
  static List<String> clothStyleList = [
    'منتقبة سواد',
    'منتقبة نقاب ملون',
    'مختمرة',
    'طرح وفساتين',
    'طرح وبناطيل',
  ];
  static List<String> faceStyleList = [
    'ملتحى',
    'لحية خفيفة',
    'أملس',
  ];
  
  static List<String> quranMemorizingList = [
    'جزء واحد',
    'جزءان',
    'ثلاثة أجزاء',
    'أربعة أجزاء',
    'خمسة أجزاء',
    'ستة أجزاء',
    'سبعة أجزاء',
    'ثمانية أجزاء',
    'تسعة أجزاء',
    'عشرة أجزاء',
    'أحد عشر جزءا',
    'اثنا عشر جزءا',
    'ثلاثة عشر جزءا',
    'أربعة عشر جزءا',
    'خمسة عشر جزءا',
    'ستة عشر جزءا',
    'سبعة عشر جزءا',
    'ثمانية عشر جزءا',
    'تسعة عشر جزءا',
    'عشرون جزءا',
    'واحد وعشرون جزءا',
    'اثنان وعشرون جزءا',
    'ثلاثة وعشرون جزءا',
    'أربعة وعشرون جزءا',
    'خمسة وعشرون جزءا',
    'ستة وعشرون جزءا',
    'سبعة وعشرون جزءا',
    'ثمانية وعشرون جزءا',
    'تسعة وعشرون جزءا',
    'ثلاثون جزءا',
  ];
  static List<String> acceptToWearNiqabList = [
    'نعم أتمنى',
    'ربما',
    'لا',
  ];

 static List<String> isParentKnowAboutLetaskonoList = [
    'نعم يعلم',
    'لا يعلم ولكن يمكننى اخباره فيما بعد',
    'لا يعلم وأحتاج للمساعدة فى اخباره',
  ];
static List<String> youAcceptToMarryWithoutQaamahList = [
    'نعم أقبل',
    'ربما',
    'لا أقبل',
  ];
static List<String> parentAcceptToMarryWithoutQaamahhList = [
    'نعم يقبل',
    'ربما',
    'لا يقبل',
  ];

}
